13/data/attachments/c39c614ec8b65046.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_02bb31c7-3d88-4dc5-b1ca-a5c8c878fa5b</nif:username>
            <nif:friendToBeAdded>Nathan_something_Actions_75110_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>